In [2]:
import numpy as np
import pandas as pd

## Series

In [3]:
benimSozlugum = {"Mustafa":26, "Büşra":23, "Burak":22}

In [4]:
pd.Series(benimSozlugum) #"benimSozlugum" adlı Python listesini Pandas Series'e dönüştürdük
#"dtype: int64" ifadesi, Series'in içindeki değerlerin tamsayı (integer) veri türünde olduğunu gösterir.

Mustafa    26
Büşra      23
Burak      22
dtype: int64

In [5]:
bYaslar =[26,23,22]
bİsimler = ["Mustafa", "Büşra", "Burak"]

In [6]:
pd.Series(bYaslar) #Bu şekilde yapılırsa kendi sırasına göre indeks atar

0    26
1    23
2    22
dtype: int64

In [7]:
pd.Series(bİsimler)

0    Mustafa
1      Büşra
2      Burak
dtype: object

In [8]:
pd.Series(bYaslar, bİsimler)

Mustafa    26
Büşra      23
Burak      22
dtype: int64

In [9]:
pd.Series(data = bYaslar, index = bİsimler) #Kendimiz data ve indeksi belirleyebiliriz

Mustafa    26
Büşra      23
Burak      22
dtype: int64

In [10]:
numpyDizisi=np.array([20,30,40,50]) #Dizi ile Series oluşturma

In [11]:
pd.Series(numpyDizisi)

0    20
1    30
2    40
3    50
dtype: int32

In [12]:
yarismaSonucu1=pd.Series([20,50,10], ["Ali", "Zeynep", "Duru"]) # pd.Series([indeks], [Data])

In [13]:
yarismaSonucu2=pd.Series([80,70,50], ["Ali", "Zeynep", "Duru"])  # pd.Series([indeks], [Data])

In [14]:
yarismaSonucu1["Duru"]

10

In [15]:
sonuc = yarismaSonucu1 + yarismaSonucu2 #2 tane series toplanabilir

In [16]:
sonuc

Ali       100
Zeynep    120
Duru       60
dtype: int64

In [17]:
Series1=pd.Series([2,7,10,15], ["a","b","c","d"]) #Farklı Series'larda kesişmeyen noktalar nan değeri döndürür

In [18]:
Series2=pd.Series([4,12,8,9], ["a","f","g","d"])

In [19]:
Son=Series1+Series2

In [20]:
Son

a     6.0
b     NaN
c     NaN
d    24.0
f     NaN
g     NaN
dtype: float64

## Data Frame

In [21]:
data = np.random.randn(4,3)

In [22]:
data

array([[-1.62181432e-03, -4.41758798e-01, -5.85712959e-01],
       [ 2.36198889e+00, -1.76583521e+00,  2.33748043e+00],
       [ 1.59749384e+00, -1.67992827e-01, -5.31846019e-01],
       [ 1.21303533e+00,  6.26933853e-01,  1.95612091e-03]])

In [23]:
dataFrame=pd.DataFrame(data)

In [24]:
dataFrame #Datayı excel gibi kopyalıyor

          0         1         2
0 -0.001622 -0.441759 -0.585713
1  2.361989 -1.765835  2.337480
2  1.597494 -0.167993 -0.531846
3  1.213035  0.626934  0.001956

In [25]:
newDataFrame = pd.DataFrame(data,index=["Duru","Asil","Deniz","Aslan"],columns=["Maas","Yas","Calisma Saati"])

In [26]:
newDataFrame

           Maas       Yas  Calisma Saati
Duru  -0.001622 -0.441759      -0.585713
Asil   2.361989 -1.765835       2.337480
Deniz  1.597494 -0.167993      -0.531846
Aslan  1.213035  0.626934       0.001956

In [27]:
newDataFrame[["Yas", "Maas" ]]#Veri çerçevesinden sadece belirli bir kısmı görüntüleyyebiliriz

            Yas      Maas
Duru  -0.441759 -0.001622
Asil  -1.765835  2.361989
Deniz -0.167993  1.597494
Aslan  0.626934  1.213035

In [28]:
newDataFrame.loc[["Duru"]]#Sadece bir satırı(row) görüntülemek istenirse

          Maas       Yas  Calisma Saati
Duru -0.001622 -0.441759      -0.585713

In [29]:
newDataFrame.iloc[[0]] #İndeksi belirterekte istenilen satırı listeleyebiliriz

          Maas       Yas  Calisma Saati
Duru -0.001622 -0.441759      -0.585713

## Data Frame İndeksler

In [30]:
newDataFrame

           Maas       Yas  Calisma Saati
Duru  -0.001622 -0.441759      -0.585713
Asil   2.361989 -1.765835       2.337480
Deniz  1.597494 -0.167993      -0.531846
Aslan  1.213035  0.626934       0.001956

In [31]:
newDataFrame["Emeklilik Yasi"] = newDataFrame["Yas"] + newDataFrame["Yas"] #Yeni column eklemek

In [32]:
newDataFrame

           Maas       Yas  Calisma Saati  Emeklilik Yasi
Duru  -0.001622 -0.441759      -0.585713       -0.883518
Asil   2.361989 -1.765835       2.337480       -3.531670
Deniz  1.597494 -0.167993      -0.531846       -0.335986
Aslan  1.213035  0.626934       0.001956        1.253868

In [33]:
newDataFrame.drop("Emeklilik Yasi", axis=1) #Herhangi bir şey silmek için drop kullanılır
#axis=1 argümanı, "drop()" fonksiyonunun sütun (column) seviyesinde işlem yapacağını belirtir.

           Maas       Yas  Calisma Saati
Duru  -0.001622 -0.441759      -0.585713
Asil   2.361989 -1.765835       2.337480
Deniz  1.597494 -0.167993      -0.531846
Aslan  1.213035  0.626934       0.001956

In [34]:
newDataFrame.drop("Duru", axis=0) #axis=0 olarak ayarlanırsa, satır (row) seviyesinde işlem yapacaktır.

           Maas       Yas  Calisma Saati  Emeklilik Yasi
Asil   2.361989 -1.765835       2.337480       -3.531670
Deniz  1.597494 -0.167993      -0.531846       -0.335986
Aslan  1.213035  0.626934       0.001956        1.253868

In [35]:
newDataFrame #newDataFrame çağırdığımızda Emeklilik Yasi sütunu ve Duru Satırının silinmediğini görüyoruz.
#Drop kalıcı değişiklik yapmaz

           Maas       Yas  Calisma Saati  Emeklilik Yasi
Duru  -0.001622 -0.441759      -0.585713       -0.883518
Asil   2.361989 -1.765835       2.337480       -3.531670
Deniz  1.597494 -0.167993      -0.531846       -0.335986
Aslan  1.213035  0.626934       0.001956        1.253868

In [36]:
newDataFrame.drop("Emeklilik Yasi", axis=1, inplace = True) 
#değişikliği kalıcı hale getirmek istiyorsak, "inplace=True" parametresini eklememiz gerekir

In [37]:
newDataFrame

           Maas       Yas  Calisma Saati
Duru  -0.001622 -0.441759      -0.585713
Asil   2.361989 -1.765835       2.337480
Deniz  1.597494 -0.167993      -0.531846
Aslan  1.213035  0.626934       0.001956

In [38]:
newDataFrame.drop("Duru", axis=0,inplace = True)

In [39]:
newDataFrame

           Maas       Yas  Calisma Saati
Asil   2.361989 -1.765835       2.337480
Deniz  1.597494 -0.167993      -0.531846
Aslan  1.213035  0.626934       0.001956

In [40]:
newDataFrame.loc["Asil"]["Calisma Saati"] #Sadece istenilen satırın istenilen sütununu listeleyebiliriz

2.337480431005116

In [41]:
newDataFrame.loc["Aslan"]["Yas"]  #Sadece istenilen satırın istenilen sütununu listeleyebiliriz

0.6269338526374153

In [42]:
newDataFrame

           Maas       Yas  Calisma Saati
Asil   2.361989 -1.765835       2.337480
Deniz  1.597494 -0.167993      -0.531846
Aslan  1.213035  0.626934       0.001956

In [43]:
newDataFrame < 0 #elemanları 0 dan küçük olanlar için true olmayanlar için false değerini döndürecektir

        Maas    Yas  Calisma Saati
Asil   False   True          False
Deniz  False   True           True
Aslan  False  False          False

In [44]:
newDataFrame["Yas"] > 0 #sadece yas sutununuda aynı şekilde kontrol edebiliriz

Asil     False
Deniz    False
Aslan     True
Name: Yas, dtype: bool

In [45]:
newDataFrame["Emeklilik Yasi"] = newDataFrame["Yas"] + newDataFrame["Yas"] #Yeni column eklemek 
#emeklilik yası adında sütun eklendi ve bu sütun yas sütünlarının toplanmasındann oluştu

In [46]:
newDataFrame = pd.DataFrame(data,index=["Duru","Asil","Deniz","Aslan"],columns=["Maas","Yas","Calisma Saati"])

In [47]:
newDataFrame

           Maas       Yas  Calisma Saati
Duru  -0.001622 -0.441759      -0.585713
Asil   2.361989 -1.765835       2.337480
Deniz  1.597494 -0.167993      -0.531846
Aslan  1.213035  0.626934       0.001956

In [48]:
newDataFrame["Emeklilik Yasi"] = newDataFrame["Yas"] + newDataFrame["Yas"] #Yeni column eklemek

In [49]:
newDataFrame

           Maas       Yas  Calisma Saati  Emeklilik Yasi
Duru  -0.001622 -0.441759      -0.585713       -0.883518
Asil   2.361989 -1.765835       2.337480       -3.531670
Deniz  1.597494 -0.167993      -0.531846       -0.335986
Aslan  1.213035  0.626934       0.001956        1.253868

In [50]:
newDataFrame.reset_index() #indeksleri resetler

   index      Maas       Yas  Calisma Saati  Emeklilik Yasi
0   Duru -0.001622 -0.441759      -0.585713       -0.883518
1   Asil  2.361989 -1.765835       2.337480       -3.531670
2  Deniz  1.597494 -0.167993      -0.531846       -0.335986
3  Aslan  1.213035  0.626934       0.001956        1.253868

In [51]:
newIndexList =["Dur", "Asi", "Den", "Asl"] #İsimlerin sadece 3 harfinden olusan yeni indeks

In [52]:
newDataFrame["Yeni İndeks"] = newIndexList

In [53]:
newDataFrame

           Maas       Yas  Calisma Saati  Emeklilik Yasi Yeni İndeks
Duru  -0.001622 -0.441759      -0.585713       -0.883518         Dur
Asil   2.361989 -1.765835       2.337480       -3.531670         Asi
Deniz  1.597494 -0.167993      -0.531846       -0.335986         Den
Aslan  1.213035  0.626934       0.001956        1.253868         Asl

In [54]:
newDataFrame.set_index("Yeni İndeks", inplace =True)

In [55]:
newDataFrame

                 Maas       Yas  Calisma Saati  Emeklilik Yasi
Yeni İndeks
Dur         -0.001622 -0.441759      -0.585713       -0.883518
Asi          2.361989 -1.765835       2.337480       -3.531670
Den          1.597494 -0.167993      -0.531846       -0.335986
Asl          1.213035  0.626934       0.001956        1.253868

In [56]:
newDataFrame.loc["Asi"] #loc[] yöntemi, belirli bir şartı sağlayan satırları filtreleyebiliriz

Maas              2.361989
Yas              -1.765835
Calisma Saati     2.337480
Emeklilik Yasi   -3.531670
Name: Asi, dtype: float64

## Multiindeks

In [57]:
ilkIndeksler =["Simpson","Simpson","Simpson","South Park", "South Park","South Park"]

In [58]:
icIndeksler =["Homer", "Bart", "Marge", "Cartman", "Kenny", "Kyle"]

In [59]:
birlesmisIndeks = list(zip(ilkIndeksler, icIndeksler))

In [60]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [61]:
birlesmisIndeks=pd.MultiIndex.from_tuples(birlesmisIndeks) #etiketlerden oluşan bir çoklu indeks nesnesi oluşturur.

In [62]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [63]:
benimCizgiFilmListem=[[30,"A"],[40,"B"],[50,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [64]:
cizgiFilmNumpyDizisi=np.array(benimCizgiFilmListem)

In [65]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndeks,columns=["Yas","Meslek"])

In [66]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    30      A
           Bart     40      B
           Marge    50      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [67]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  30      A
Bart   40      B
Marge  50      C

In [69]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [70]:
cizgiFilmDataFrame.index.names =["Film Adı", "İsim"]

In [71]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    30      A
           Bart     40      B
           Marge    50      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

## Eksik Veriler operasyonlar

In [73]:
sozlukVerisi={"Bilecik": [25,29,np.nan], "Osmaniye":[35,np.nan,41], "Hatay":[36,42,np.nan]}
havaDurumuDataFrame=pd.DataFrame(sozlukVerisi)

In [74]:
havaDurumuDataFrame

   Bilecik  Osmaniye  Hatay
0     25.0      35.0   36.0
1     29.0       NaN   42.0
2      NaN      41.0    NaN

In [75]:
havaDurumuDataFrame.dropna() #eksik (NaN) değerlere sahip satırları veya sütunları kaldırmak için kullanılır.

   Bilecik  Osmaniye  Hatay
0     25.0      35.0   36.0

In [84]:
yeniVeri={"Bilecik": [25,29,np.nan], "Osmaniye":[35,np.nan,41], "Hatay":[36,42,np.nan], "Ankara":[45,np.nan,np.nan]}
yeniDataFrame=pd.DataFrame(yeniVeri)

In [85]:
havaDurumuDataFrame

   Bilecik  Osmaniye  Hatay  Ankara
0     25.0      35.0   36.0    45.0
1     29.0       NaN   42.0     NaN
2      NaN      41.0    NaN     NaN

In [86]:
yeniDataFrame.dropna(axis=1, thresh=2) #2tane non olanları drop et

   Bilecik  Osmaniye  Hatay
0     25.0      35.0   36.0
1     29.0       NaN   42.0
2      NaN      41.0    NaN

In [87]:
yeniDataFrame.dropna(axis=0, thresh=2) #2tane non olanları drop et

   Bilecik  Osmaniye  Hatay  Ankara
0     25.0      35.0   36.0    45.0
1     29.0       NaN   42.0     NaN

In [88]:
yeniDataFrame.fillna(20) #boş olanları doldur

   Bilecik  Osmaniye  Hatay  Ankara
0     25.0      35.0   36.0    45.0
1     29.0      20.0   42.0    20.0
2     20.0      41.0   20.0    20.0

## Group By

In [109]:
maasSozlugu={"Departman": ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk", "Hukuk"],
            "Calisan İsmi": ["Ahmet","Mehmet","Atil","Burak", "Zeynep", "Fatma"],
            "Mass":[100,150,200,300,400,500]
            }

In [110]:
maasDataFrame=pd.DataFrame(maasSozlugu)

In [111]:
maasDataFrame

   Departman Calisan İsmi  Mass
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   150
2  Pazarlama         Atil   200
3  Pazarlama        Burak   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [112]:
grupObjesi=maasDataFrame.groupby("Departman")

In [113]:
grupObjesi.count() #Hangi departmanda kaç kişi çalışıyor

           Calisan İsmi  Mass
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [114]:
grupObjesi.mean() #Herbir departmanın ortalama maaşları

C:\Users\MONSTER\AppData\Local\Temp\ipykernel_10376\1370264299.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grupObjesi.mean() #Hangi departmanda kaç kişi çalışıyor

            Mass
Departman
Hukuk      450.0
Pazarlama  250.0
Yazılım    125.0

In [115]:
grupObjesi.max() #DEpartmanda en yüksek maaş alanlar

          Calisan İsmi  Mass
Departman
Hukuk           Zeynep   500
Pazarlama        Burak   300
Yazılım         Mehmet   150

In [116]:
grupObjesi.describe() #İstatiksel özet biilgilerini listeler

           Mass
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

## Concat

In [119]:
sozluk1={"Isim": ["Ahmet", "Mehmet", "Zeynep", "Atıl"],
         "Spor:":["Koşu", "Yüzme", "Koşu", "Basketbol"],
         "Kalori":[100,200,300,400]}

In [122]:
dataFrame1 = pd.DataFrame(sozluk1, index=[0,1,2,3])

In [128]:
sozluk2={"Isim": ["Osman", "Levent", "Atlas", "Fatma"],
         "Spor:":["Koşu", "Yüzme", "Koşu", "Basketbol"],
         "Kalori":[200,100,50,300]}

In [132]:
dataFrame2 = pd.DataFrame(sozluk2, index=[4,5,6,7])

In [133]:
sozluk3={"Isim": ["Ayse", "Mahmut", "Duygu", "Nur"],
         "Spor:":["Koşu", "Yüzme", "Badminton", "Tenis"],
         "Kalori":[200,100,50,300]}

In [134]:
dataFrame3 = pd.DataFrame(sozluk3, index=[8,9,10,11])

In [136]:
dataFrame1

     Isim      Spor:  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [137]:
dataFrame2

     Isim      Spor:  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7   Fatma  Basketbol     300

In [138]:
dataFrame3

      Isim      Spor:  Kalori
8     Ayse       Koşu     200
9   Mahmut      Yüzme     100
10   Duygu  Badminton      50
11     Nur      Tenis     300

# concatenation

In [140]:
pd.concat([dataFrame1,dataFrame2,dataFrame3], axis=0) #3tabloyu virleştirmiş oldu

      Isim      Spor:  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayse       Koşu     200
9   Mahmut      Yüzme     100
10   Duygu  Badminton      50
11     Nur      Tenis     300

# merge

In [144]:
mergeSozluk1={"İsim": ["Ahmet", "Mehmet", "Zeynep","Atıl"],
              "Spor": ["Koşu", "Yüzme", "Koşu", "Basketbol"]}

In [145]:
mergeSozluk2={"İsim": ["Ahmet", "Mehmet", "Zeynep","Atıl"],
              "Kalori": [100,200,150,250]}

In [147]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [148]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [149]:
mergeDataFrame1

     İsim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [150]:
mergeDataFrame2

     İsim  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     150
3    Atıl     250

In [155]:
pd.merge(mergeDataFrame1,mergeDataFrame2, on="İsim") #Birleştirme kaynaştırma işlemi yapıldı
#ortak nokta üzerinde birleştirildi

     İsim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     150
3    Atıl  Basketbol     250

In [156]:
maasSozluk ={"İsim": ["Atıl","Zeynep","Mehmet","Ahmet"],
             "Departman": ["Yazılım", "Satış", "Pazarlama", "Yazılım"],
             "Maas": [200,300,400,500]}

In [158]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [159]:
maasDataFrame

     İsim  Departman  Maas
0    Atıl    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [160]:
maasDataFrame["Departman"].unique() #Departmanları tekrarlamadan şekilde listeler

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [161]:
maasDataFrame["Departman"].nunique() #Kaç tane departman olduğunu tekrarlamadan listeler

3

In [163]:
maasDataFrame["Departman"].value_counts() #hangi departmandan kaç tane olduğunu tekrarlamadan listeler

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [168]:
def bruttenNete(maas):
    return maas * 0.66

In [170]:
maasDataFrame["Maas"].apply(bruttenNete) #oluşturmuşolduğum bruttenNete() fonksiyonunu uyguluyorum

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [171]:
maasDataFrame.isnull()

    İsim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False